Revit 2027 API
ExporterIFCUtils.ComputeRoofProjectedArea Method
 Returns the projected area of the room, unscaled.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double ComputeRoofProjectedArea(
	Element pElem
)
Public Shared Function ComputeRoofProjectedArea (
	pElem As Element
) As Double
public:
static double ComputeRoofProjectedArea(
	Element^ pElem
)
static member ComputeRoofProjectedArea :
        pElem : Element -> float
Parameters
pElem Element
 The roof.
Return Value
Double
 The projected area.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace